{
  "nome": "Angelo Ferdinand Imon Spanó",
  "email": "angeloimon@outlook.com",
  "links": {
    "github": "https://github.com/AngeloImon",
    "linkedin": "https://www.linkedin.com/in/angelo-ferdinand-imon-spano-73386b197/"
  },
  "resumo": "Desenvolvedor em transição para a área de tecnologia, atualmente cursando Análise e Desenvolvimento de Sistemas pela FATEC-RP. Fluente em inglês (TOEIC 945) e com sólida experiência em suporte técnico, atendimento ao cliente e análise de crédito. Desenvolvi projetos práticos com foco em lógica, estrutura de dados, automações e visão computacional — aplicando Python, SQL, C++, Oracle BD e OpenCV. Integro Git/GitHub e metodologias ágeis no versionamento e organização dos projetos. Minhas experiências com usuários finais, gestão de setores e comunicação contribuem para soluções tecnológicas empáticas, claras e voltadas à entrega de valor. Estou pronto para crescer e colaborar em times que valorizem iniciativa, aprendizado contínuo e impacto com propósito.",
  "formacao": "Tecnólogo em Análise e Desenvolvimento de Sistemas – FATEC-RP (2022–2025)",
  "habilidades": [
    "Python",
    "C++",
    "PL/SQL",
    "Oracle DB",
    "Git/GitHub",
    "VS Code",
    "Google Colab"
  ],
  "certificacoes": [
    "TOEIC - 945 pontos (2025)",
    "SAP/ABAP",
    "Oracle BD Design",
    "Oracle SQL",
    "Soft Skills para profissionais de TI",
    "Controle de Impulso e Manejo Emocional",
    "Mini-Curso Veículos Autônomos",
    "Visão Computacional com OpenCV"
  ],
  "experiencia": [
    {
      "empresa": "Foxtime",
      "cargo": "Assistente Administrativo I",
      "periodo": "mai/2021 – mai/2022",
      "tarefas": [
        "Analisei crédito e documentos para aprovação de financiamentos.",
        "Mantive atualizados os bancos de dados internos via planilhas e sistemas corporativos.",
        "Estabeleci parcerias comerciais e conduzi vendas consultivas de seguros."
      ]
    },
    {
      "empresa": "Museu da Gula",
      "cargo": "Atendente / Especialista responsável de setor",
      "periodo": "dez/2014 – fev/2020",
      "tarefas": [
        "Gerenciei o setor de destilados, incluindo reposição, vitrine e supervisão de estoque.",
        "Realizei atendimento personalizado, contribuindo para o aumento das vendas por recomendação direta.",
        "Treinei atendentes, organizei escalas e apoiei a liderança com foco em metas e KPIs de vendas."
      ]
    },
    {
      "empresa": "Fundamental TI",
      "cargo": "Digitalizador",
      "periodo": "nov/2013 – dez/2014",
      "tarefas": [
        "Digitalizei e classifiquei documentos cartoriais com foco em acurácia e integridade de dados.",
        "Prestei suporte técnico interno na manutenção e organização dos arquivos digitais.",
        "Estruturei arquivos digitais para indexação em sistema interno de dados, otimizando resultados."
      ]
    }
  ],
  "projetos": [
    {
      "nome": "Classificador de sobrevivência do Titanic – Machine learning com Scikit-learn ",
      "descricao": "Modelo supervisionado para prever a sobrevivência de passageiros a partir do Titanic Dataset.",
      "link": "https://github.com/AngeloImon/Aulas-IA/blob/main/Trabalho_IA_Classificador_Titanic.ipynb"
    },
    {
      "nome": "Processamento de Imagens Digitais – Segmentação e manipulação com OpenCV + Matplotlib",
      "descricao": "Explora técnicas fundamentais de processamento de imagem com aplicação de imagens reais.",
      "link": "https://github.com/AngeloImon/Aulas-IA/blob/main/Prova_Pr%C3%A1tica_IA_2.ipynb"
    },
    {
      "nome": "Criptosistema RSA com Aritmética Modular – Algoritmo de criptografia em Python",
      "descricao": "Implementa o algoritmo de criptografia RSA do zero usando aritmética modular, incluindo geração de chaves públicas e privadas.",
      "link": "https://github.com/AngeloImon/Colab/blob/main/Exemplo_Criptografia_RSA.ipynb"
    },
    {
      "nome": "Otimização da Força de Trabalho – Modelagem com Programação Linear usando Python + Gurobi",
      "descricao": "Otimização de escalas de trabalho, minimizando os custos salarias em diferentes cenários.",
      "link": "https://github.com/AngeloImon/Programacao-Linear/blob/main/Trabalho%20Final.py"
    }
  ],
  "secoes": {
    "resumo": "Resumo",
    "experiencia": "Experiência Profissional",
    "habilidades": "Habilidades Técnicas",
    "formacao": "Formação",
    "certificacoes": "Certificações",
    "projetos": "Projetos"
  }
}