{
  "nome": "Angelo Ferdinand Imon Spanó",
  "email": "angeloimon@outlook.com",
  "subtitulo": "Desenvolvedor em Formação (Fatec) | Python • C++ • PL/SQL • Git/GitHub • Banco de Dados Oracle | Lógica, Suporte Técnico e Inglês Fluente (TOEIC 945)",
  "lastUpdated": "30 de julho de 2025",
  "links": {
    "github": "https://github.com/AngeloImon",
    "linkedin": "https://www.linkedin.com/in/angelo-ferdinand-imon-spano-73386b197"
  },
  "resumo": "Desenvolvedor em transição para a área de tecnologia, atualmente cursando Análise e Desenvolvimento de Sistemas pela FATEC-RP. Fluente em inglês (TOEIC 945) e com sólida experiência em suporte técnico, atendimento ao cliente e análise de crédito. Desenvolvi projetos práticos com foco em lógica, estrutura de dados, automações e visão computacional — aplicando Python, SQL, C++, Oracle BD e OpenCV. Integro Git/GitHub e metodologias ágeis no versionamento e organização dos projetos. Minhas experiências com usuários finais, gestão de setores e comunicação contribuem para soluções tecnológicas empáticas, claras e voltadas à entrega de valor. Estou pronto para crescer e colaborar em times que valorizem iniciativa, aprendizado contínuo e impacto com propósito.",
  "formacao": "Tecnólogo em Análise e Desenvolvimento de Sistemas – FATEC-RP (2022–2025)",
  "habilidades": [
    "Python",
    "C++",
    "PL/SQL",
    "Dart",
    "HTML5",
    "CSS",
    "JS",
    "VBA",
    "Oracle DB",
    "Git/GitHub",
    "VS Code",
    "Google Colab",
    "Linux",
    "Servidor Windows",
    "Microsoft Office",
    "Desenvolvimento de aplicativos",
    "Metodologias ágeis",
    "Controle de qualidade",
    "Gestão de equipes",
    "Banco de dados",
    "Estrutura de dados",
    "Database Design",
    "Algoritmos",
    "Abordagem lógica",
    "Ciência da computação",
    "Comunicação",
    "Capacidade de adaptação",
    "Comprometimento",
    "Trabalho em equipe",
    "Relacionamento com clientes",
    "Resolução de problemas",
    "Habilidades analíticas",
    "Levantamento de requisitos",
    "Relatório",
    "Suporte técnico",
    "Informática",
    "Trabalho remoto",
    "Tecnologia da informação",
    "Montagem de computadores"
  ],
  "certificacoes": [
    "TOEIC - 945 pontos (2025)",
    "SAP/ABAP",
    "Oracle BD Design",
    "Oracle SQL",
    "Soft Skills para profissionais de TI",
    "Controle de Impulso e Manejo Emocional",
    "Mini-Curso Veículos Autônomos",
    "Visão Computacional com OpenCV"
  ],
  "experiencia": [
    {
      "empresa": "Foxtime",
      "cargo": "Assistente Administrativo I",
      "periodo": "mai/2021 – mai/2022",
      "tarefas": [
        "Analisei crédito e documentos para aprovação de financiamentos.",
        "Mantive atualizados os bancos de dados internos via planilhas e sistemas corporativos.",
        "Estabeleci parcerias comerciais e conduzi vendas consultivas de seguros."
      ]
    },
    {
      "empresa": "Museu da Gula",
      "cargo": "Atendente / Especialista responsável de setor",
      "periodo": "dez/2014 – fev/2020",
      "tarefas": [
        "Gerenciei o setor de destilados, incluindo reposição, vitrine e supervisão de estoque.",
        "Realizei atendimento personalizado, contribuindo para o aumento das vendas por recomendação direta.",
        "Treinei atendentes, organizei escalas e apoiei a liderança com foco em metas e KPIs de vendas."
      ]
    },
    {
      "empresa": "Fundamental TI",
      "cargo": "Digitalizador",
      "periodo": "nov/2013 – dez/2014",
      "tarefas": [
        "Digitalizei e classifiquei documentos cartoriais com foco em acurácia e integridade de dados.",
        "Prestei suporte técnico interno na manutenção e organização dos arquivos digitais.",
        "Estruturei arquivos digitais para indexação em sistema interno de dados, otimizando resultados."
      ]
    }
  ],
  "projetos": [
    {
      "nome": "Estratégia de Machine Learning aplicada a campanhas reais",
      "descricao": "Executa um pipeline completo de clustering e classificação supervisionada no dataset 'Marketing Campaign'. Inclui pré-processamento, uso de PCA, definição de clusters com K-Means e treinamento de modelo com regressão logística.",
      "link": "https://github.com/AngeloImon/Aulas-IA/blob/main/Prova_Prática_IA_1.ipynb"
    },
    {
      "nome": "Classificador de sobrevivência do Titanic – Machine learning com Scikit-learn ",
      "descricao": "Executa uma classificação supervisionada para prever a sobrevivência de passageiros a partir do Titanic Dataset, utilizando técnicas estatísticas e modelos de machine learning.",
      "link": "https://github.com/AngeloImon/Aulas-IA/blob/main/Trabalho_IA_Classificador_Titanic.ipynb"
    },
    {
      "nome": "Processamento de Imagens Digitais – Segmentação e manipulação com OpenCV + Matplotlib",
      "descricao": "Explora técnicas fundamentais de processamento de imagem usando OpenCV em ambiente Google Colab, com aplicação em imagens reais e sintéticas.",
      "link": "https://github.com/AngeloImon/Aulas-IA/blob/main/Prova_Pr%C3%A1tica_IA_2.ipynb"
    },
    {
      "nome": "Criptosistema RSA com Aritmética Modular – Algoritmo de criptografia em Python",
      "descricao": "Implementa o algoritmo de criptografia RSA do zero usando aritmética modular, incluindo geração de chaves públicas e privadas.",
      "link": "https://github.com/AngeloImon/Colab/blob/main/Exemplo_Criptografia_RSA.ipynb"
    },
    {
      "nome": "Otimização de Carga Veicular com Gurobi",
      "descricao": "Resolve um problema de carga de veículo utilizando programação linear inteira, considerando peso máximo, valor dos produtos, quantidades disponíveis e restrições de incompatibilidade entre itens. Retorna a solução ótima com lista dos itens selecionados e peso total carregado.",
      "link": "https://github.com/AngeloImon/Colab/blob/main/prog_linear_pesq_operacional_carga_veiculo.ipynb"
    },
    {
      "nome": "Otimização da Força de Trabalho – Modelagem com Programação Linear usando Python + Gurobi",
      "descricao": "Otimização de escalas de trabalho, minimizando os custos salarias em diferentes cenários.",
      "link": "https://github.com/AngeloImon/Programacao-Linear/blob/main/Trabalho%20Final.py"
    },
    {
      "nome": "Aplicativo de Organização de Estudos com NiceGUI",
      "descricao": "Aplicativo web desenvolvido em Python com a biblioteca NiceGUI, focado em auxiliar usuários na criação de planos de estudo personalizados, gerenciamento visual de cronogramas semanais e exportação de dados. Possui sistema de autenticação, dashboard com métricas, planejamento por dias da semana e calendário, além de integração com Firebase para armazenamento em nuvem.",
      "link": "https://github.com/AngeloImon/Projeto_P2_TEI"
    },
    {
      "nome": "Aplicativo de Gerenciamento Financeiro Pessoal — Flutter + Firebase",
      "descricao": "Aplicativo mobile multiplataforma criado com Flutter e integrado ao Firebase, voltado para o controle financeiro pessoal. Permite registrar receitas e despesas, visualizar saldo consolidado, organizar movimentações em planilhas mensais e acessar relatórios detalhados. Conta com autenticação segura, atualização em tempo real e arquitetura modular com telas específicas para login, entradas e visualizações.",
      "link": "https://github.com/MariTaba/projeto_gerenciamento_financas"
    }
  ],
  "secoes": {
    "resumo": "Resumo",
    "experiencia": "Experiência Profissional",
    "habilidades": "Habilidades Técnicas",
    "formacao": "Formação",
    "certificacoes": "Certificações",
    "projetos": "Projetos"
  }
}
